[
  {
      "role": "Junior Software Engineer",
      "organisation": "CORE 360",
      "startDate": "Apr, 2020",
      "endDate": "Jan, 2023",
      "experiences": [
          "Designed and optimized user interfaces and front-end architecture for various client projects using React.js, collaborating closely with UX/UI designers to deliver user-friendly and visually appealing applications.",
          "Worked on enhancing an application’s self-service portal, which enhanced customer service delivery by over 30% while simultaneously maintaining high performance via website maintenance, fixing bugs, and updating login features.",
          "Utilised multiple backend frameworks to create secure and efficient client-server interactions, and optimized data retrieval with REST APIs using Redis caching.",
          "Seamlessly integrated payment gateways, including Pay-Stack, Stripe, and Flutter-Wave, to simplify transactions and improve user convenience, while adhering to best practices for security and usability.",
          "Enhanced application security using JWT-based user authentication, HTTP-only cookies, and role-based access control, safeguarding sensitive data and managing user permissions effectively.",
          "Utilized tools like Git for version control and Postman for API testing and documentation, fostering a collaborative development environment through code reviews and constructive feedback."
      ],
      "imageSrc": "history/core360.png"
  },
  {
      "role": "Software Engineer Intern",
      "organisation": "CORE 360",
      "startDate": "Apr, 2019",
      "endDate": "Mar, 2020",
      "experiences": [
          "Collaborated with engineering teams to design, develop, and maintain software applications, emphasizing clean, efficient, and well-documented code written in Python, Java, and JavaScript.",
          "Contributed to both front-end and back-end development tasks, including building responsive user interfaces using ReactJS and implementing server-side logic and APIs with Node.js and Java Spring Boot, particularly for e-commerce solutions.",
          "Assisted team members in creating detailed documentation for various codebases and workflows, carefully maintaining clarity and accessibility for team members and seamless knowledge transfer for ongoing development.",
          "Stayed updated on industry trends, exploring advancements in SaaS, serverless platforms, and advanced CRM integrations to improve development processes.",
          "Worked closely with cross-functional teams including product managers, designers, and developers to deliver high-quality solutions aligned with project goals.",
          "Used Git for version control and participated in Agile development methodologies, including daily stand-ups and sprint planning, to streamline project workflows."
      ],
      "imageSrc": "history/core360.png"
  }
]
